// Логические выражения 
// >, <, >=, <=, !=, ==, ===, !==

console.log('is 5 > 2', 5 > 2); 
console.log('is 5 < 2', 5 < 2); 

console.log('is egual: 5 and 5', 5 == 5);
console.log('is egual: 5 and 4', 5 == 4);
console.log('is egual: 5 and "5"', 5 === '5');

console.log('is not equal: 10 and 8', 10 != 8);
console.log('is not equal: 10 and "10"', 10 !== "10");

// составные логические выражения
// И - && (true - когда оба выражения истины)

1 === 1 && 2===2; // true
1 === 1 && 2==='2'; // false
  
// ИЛИ - || (true - когда хоть одно выражения истина)

1 === 2 || 2 === 2; // true
1 === 2 || 2 === 3; // false
1 === 2 || 2 === 3 || 4 === 4; // true

// Сочинения И, ИЛИ 
1 === 2 || (2 === 3 && 4 === 4); // false
1 === 1 || (2 === 3 && 4 === 4); // true